{
    "challenges" : 
    [
        {
            "title": "Day 1",
            "date": "2024-12-25",
            "challengeText" : "Merry <Code>mas! I've devised some programming challenges and ideas just for you! I would love your program to be more festive, can you add customisable themes so I can make all the buttons red and green for Christmas?"
        },
        {
            "title": "Day 2",
            "date": "2024-12-26",
            "challengeText" : "I'm curious whether Wordle would be more difficult with 6 letter words or 3 letter words, could you build a version that would let me try them out?"
        },
        {
            "title": "Day 3",
            "date": "2024-12-27",
            "challengeText" : "I've found this website of interesting challenges. Choose one for us both to do, then we can compare how we did it. Maybe even make it into a blog post?",
            "link": "https://projecteuler.net/recent",
            "linkText" : "ProjectEuler"
        },
        {
            "title": "Day 4",
            "date": "2024-12-28",
            "challengeText" : "When I'm looking after the chickens you still need your Eggio data! How about adding a tool to your website where I could log what eggs I find? You could hide it behind a password so you don't get fake entries"
        },
        {
            "title": "Day 5",
            "date": "2024-12-29",
            "challengeText" : "Maybe you can combine your coding and table tennis skills somehow. Either for a scoring system or, more interestingly, for spin calculations.",
            "link": "http://sonic.net/~goddard/home/spin/docs/spin.html",
            "linkText" : "Here's some inspiration"
        },
        {
            "title": "Day 6",
            "date": "2024-12-30",
            "challengeText" : "There are many cool APIs available publicly, find one that interests you to make a new feature for your website!",
            "link": "https://github.com/public-apis/public-apis?tab=readme-ov-file#weather",
            "linkText" : "Maybe yet another temperature device? :D"
        },
        {
            "title": "Day 7",
            "date": "2024-12-31",
            "challengeText" : "You made it to the end of <code>mas! We should play a game to celebrate, can you make one we can play together remotely?"
        }
        
    ]
}